Catalogs/МашиночитаемыеДоверенностиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МашиночитаемыеДоверенностиКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLфайлМЧД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Верна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания в ИБ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВРеестреФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоПредставителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отозвана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолномочияОграничены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовместныеПолномочия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВРеестреФНС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМашиночитаемойДоверенностиВРеестреФНС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибкиПроверкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПодпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителяРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСкриптПроверкиПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияПолномочий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаполненияПолномочийМЧД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставительИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПравилаПроверкиПолномочийМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПроверкиПолномочийМЧД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Скрипт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоНастроено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоляДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПроверкиРасширенные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МнемоникаПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОграничения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗначенияОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЗначенияОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстовоеОписаниеОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСопоставления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МашиночитаемыеДоверенностиКонтрагентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем УдаляемыйПорядковыйНомер;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект.Ссылка, ЭтотОбъект);
	
	ЗаполнитьТабличныйДокументМЧД();
		
	ПодписанныеДокументы.Параметры.УстановитьЗначениеПараметра("Доверенность", Объект.Ссылка);
	
	ЕстьПравоИзмененияМЧД = МашиночитаемыеДоверенности.ИмеетсяПравоИзмененияМЧД();
			
	Справочники.ПравилаПроверкиПолномочийМЧД.ПриСозданииНаСервереФормыНастроек(ЭтотОбъект);
	
	УстановитьДоступностьЭлементов();
	
	ПротоколПроверкиИзМЧД = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ПротоколПроверки").Получить();
			
	Если ПротоколПроверкиИзМЧД <> Неопределено Тогда
		ПротоколПроверкиМЧД = ПротоколПроверкиИзМЧД;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Скрипт = СкриптТекст;
	
	Справочники.ПравилаПроверкиПолномочийМЧД.ЗаписатьПравило(ТекущийОбъект.Ссылка, ЭтотОбъект);
	Справочники.ПравилаПроверкиПолномочийМЧД.ПриЧтенииНастроек(Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СсылкаНаДоверенность = Объект.Ссылка;
	
	Справочники.ПравилаПроверкиПолномочийМЧД.ПриЧтенииНастроек(ТекущийОбъект, ЭтотОбъект);
	ЗаполнитьНастройкиПравилПроверки(СсылкаНаДоверенность);
	
	ВерсияИзменилась = ВерсияИзменилась ИЛИ (ЗначениеЗаполнено(ТекущаяВерсия) И ТекущаяВерсия <> ТекущийОбъект.ВерсияДанных);
	ТекущаяВерсия = ТекущийОбъект.ВерсияДанных;
	
	ПротоколПроверкиИзМЧД = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДоверенность, "ПротоколПроверки").Получить();

	Если ПротоколПроверкиИзМЧД <> Неопределено Тогда
		ПротоколПроверкиМЧД = ПротоколПроверкиИзМЧД;
		Если Не ЗначениеЗаполнено(Объект.ТекстОшибкиПроверкиМЧД) 
			И ЗначениеЗаполнено(ПротоколПроверкиИзМЧД.ОписаниеОшибки) Тогда
			Объект.ТекстОшибкиПроверкиМЧД = ПротоколПроверкиИзМЧД.ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ТекстОшибкиПроверкиМЧДКлассифицирован = 
		ЗначениеЗаполнено(Объект.ТекстОшибкиПроверкиМЧД)
		И Не ЭлектроннаяПодпись.ОшибкаПоКлассификатору(Объект.ТекстОшибкиПроверкиМЧД) = Неопределено;
	
	Если ТекстОшибкиПроверкиМЧДКлассифицирован Тогда
		ДанныеФайла = МашиночитаемыеДоверенности.ДанныеФайлаДоверенностиИПодписи(Объект.Ссылка);
		ДанныеПодписи = ПоместитьВоВременноеХранилище(ДанныеФайла.ДанныеПодписи, УникальныйИдентификатор);
		СвойстваПодписи = ЭлектроннаяПодпись.СвойстваПодписи(ДанныеФайла.ДанныеПодписи, Истина);
		ДанныеСертификатаПодписи = ПоместитьВоВременноеХранилище(СвойстваПодписи.Сертификат, УникальныйИдентификатор);
		СертификатПодписи = ЭлектроннаяПодпись.СсылкаНаСертификат(СвойстваПодписи.Отпечаток);
	КонецЕсли;
	
	ЗаполнитьДанныеРучнойПроверкиНаФорме();
	МашиночитаемыеДоверенности.ОбновитьЗаголовкиЭлементовФормы(ТекущийОбъект.Ссылка, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	СкриптТекст = Скрипт;
	РазвернутьДеревоВизуализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И ВерсияИзменилась Тогда
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЖурналМашиночитаемыхДоверенностей"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МашиночитаемыеДоверенностиКлиент.РазвернутьДеревоВизуализации(ЭтотОбъект, 0);
	МашиночитаемыеДоверенностиКлиент.ОповеститьОИзмененииМЧД(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкриптИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Модифицированность = Истина;
	СкриптТекст = Текст;
	ПравилоНастроено = ЗначениеЗаполнено(Текст);
	МашиночитаемыеДоверенностиКлиент.СформироватьЗаголовокВкладкиПолномочия(ЭтотОбъект, ПравилоНастроено);
КонецПроцедуры

&НаКлиенте
Процедура ВариантПроверкиПриИзменении(Элемент)
	МашиночитаемыеДоверенностиКлиент.ОтобразитьВариантПроверки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииПодписьМЧДНажатие(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ТекстОшибкиПроверкиМЧД) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыОшибкиКриптографии = Новый Структура();
	ПараметрыОшибкиКриптографии.Вставить("КраткоеПредставлениеОшибки", Объект.ТекстОшибкиПроверкиМЧД);
	ПараметрыОшибкиКриптографии.Вставить("ЗаголовокПроблемы", НСтр("ru = 'Проверка подписи машиночитаемой доверенности'"));
	ПараметрыОшибкиКриптографии.Вставить("ДанныеПодписи", ДанныеПодписи);
	ПараметрыОшибкиКриптографии.Вставить("ДанныеСертификата", ДанныеСертификатаПодписи);
	ПараметрыОшибкиКриптографии.Вставить("Сертификат", СертификатПодписи);
	КриптографияБЭДКлиент.ОткрытьФормуРасширенногоПредставленияОшибки(Неопределено, ПараметрыОшибкиКриптографии);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВключеныПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	УстановитьВидимостьКомандыПроверкаПодписи(); 
	
	Если ПравилаВключены Тогда 
		
		Записать();
		ВыполнитьПроверкуПодписейПоПравиламДоверенности();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПолномочийСОграничениями

&НаКлиенте
Процедура ДеревоПолномочийСОграничениямиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	РежимыРедактирования = МашиночитаемыеДоверенностиКлиент.ПолучитьРежимыРедактированияПравила();
	
	Если Копирование Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		Если ТекущиеДанные.Предопределенное Тогда
			ТекстСообщенияПользователю = 
				НСтр("ru = 'Копирование правил, созданных на основании полномочий МЧД, запрещено. Копирование допускается только на основании новых правил.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияПользователю);
			
		Иначе
			МашиночитаемыеДоверенностиКлиент.ОткрытьФормуРедактированияПолномочия(
				ЭтотОбъект, НастройкиПроверкиРасширенные, ТекущиеДанные.ПорядковыйНомер, РежимыРедактирования.Копирование); 
		КонецЕсли;
		
	Иначе
		МашиночитаемыеДоверенностиКлиент.ОткрытьФормуРедактированияПолномочия(
			ЭтотОбъект, НастройкиПроверкиРасширенные, 0, РежимыРедактирования.Добавление);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоПолномочийСОграничениямиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭлементДерева = ДеревоПолномочийСОграничениями.НайтиПоИдентификатору(ВыбраннаяСтрока);
	РежимыРедактирования = МашиночитаемыеДоверенностиКлиент.ПолучитьРежимыРедактированияПравила();
	
	Если Не ЭлементДерева.Предопределенное Тогда 
		МашиночитаемыеДоверенностиКлиент.ОткрытьФормуРедактированияПолномочия(ЭтотОбъект, НастройкиПроверкиРасширенные, 
			ЭлементДерева.ПорядковыйНомер, РежимыРедактирования.Редактирование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолномочийСОграничениямиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	РежимыРедактирования = МашиночитаемыеДоверенностиКлиент.ПолучитьРежимыРедактированияПравила();
	МашиночитаемыеДоверенностиКлиент.ОткрытьФормуРедактированияПолномочия(ЭтотОбъект, НастройкиПроверкиРасширенные, 
		Элемент.ТекущиеДанные.ПорядковыйНомер, РежимыРедактирования.Редактирование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолномочийСОграничениямиПередУдалением(Элемент, Отказ)
	
	УдаляемыйПорядковыйНомер = Элемент.ТекущиеДанные.ПорядковыйНомер;
	Если УдаляемыйПорядковыйНомер = 0 
		Или Элемент.ТекущиеДанные.Предопределенное Тогда
		ТекстСообщенияПользователю = 
			НСтр("ru = 'Правила, созданные на основании полномочий МЧД, нельзя удалить. Удаление допускается только для новых правил.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияПользователю, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолномочийСОграничениямиПослеУдаления(Элемент)

	Модифицированность = Истина; 
	ПараметрыВыполнения = МашиночитаемыеДоверенностиКлиент.НовыйПараметрыОткрытияФормыРедактированияПолномочий();
	ПараметрыВыполнения.ПорядковыйНомер = УдаляемыйПорядковыйНомер;
	
	ОбработатьСобытиеДереваПолномочийСОграничениями(ПараметрыВыполнения, Истина);
	УстановитьДоступностьИСостояниеПереключателяПравилаВключены();
	РазвернутьДеревоВизуализации();
	МашиночитаемыеДоверенностиКлиент.СформироватьЗаголовокВкладкиПолномочия(ЭтотОбъект, ПравилаВключены);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодписанныеДокументы

&НаКлиенте
Процедура ПодписанныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ПодписанныеДокументыИнформацияОПроверке Тогда 
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Новый ОписаниеОповещения, 
			ДанныеСтроки.ИнформацияОПроверке, "Подробнее");
	Иначе 
		ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокумент(ДанныеСтроки.Ссылка);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ДлительнаяОперация = НачатьОбновлениеСтатусаИзРеестраФНС(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбновленияСтатусаВРеестреФНС", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьОтозванной(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПометитьОтозваннойЗавершение", ЭтотОбъект);
	МашиночитаемыеДоверенностиКлиент.УстановитьПометкуОтозвана(
		Оповещение, Объект.Ссылка, Не Объект.Отозвана, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВерной(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПометитьВернойЗавершение", ЭтотОбъект);
	МашиночитаемыеДоверенностиКлиент.УстановитьПометкуВерна(Оповещение, Объект.Ссылка, Не Объект.Верна, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Посмотреть(Команда)
	
	Содержимое = МашиночитаемыеДоверенностиВызовСервера.ВыгрузитьXML(Объект.Ссылка);
	Текст = Новый ТекстовыйДокумент();
	Текст.УстановитьТекст(Содержимое);
	Текст.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьОшибки(Команда)
	
	Элементы.ПоказатьСкрытьОшибки.Пометка = Не Элементы.ПоказатьСкрытьОшибки.Пометка;
	ОбновитьОтборПоСостоянию();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПровереныУспешно(Команда)
	
	Элементы.ПоказатьСкрытьПровереныУспешно.Пометка = Не Элементы.ПоказатьСкрытьПровереныУспешно.Пометка;
	ОбновитьОтборПоСостоянию();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписи(Команда)
	
	Если Модифицированность Тогда 
		Записать();	
	КонецЕсли;
	
	ПроверяемыеДокументы = Новый Массив;	
	ВыделенныеСтроки = Элементы.ПодписанныеДокументы.ВыделенныеСтроки;
	
	Для Каждого СтрокаСписка Из ВыделенныеСтроки Цикл
		СтрокаДанныхПоДокументам = Элементы.ПодписанныеДокументы.ДанныеСтроки(СтрокаСписка);
		ПроверяемыеДокументы.Добавить(СтрокаДанныхПоДокументам.Ссылка);
	КонецЦикла;
	
	ВыполнитьПроверкуПодписейПоПравиламДоверенности(ПроверяемыеДокументы);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПодписанныеДокументы(Команда)
	ОбновитьСписокПодписанныеДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерепроверитьПодпись(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПроверкаПодписиМЧДЗавершение", ЭтотОбъект);
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	ПараметрыПроверкиМЧД = Новый Структура();
	ПараметрыПроверкиМЧД.Вставить("МЧД", Объект.Ссылка);
	ПараметрыПроверкиМЧД.Вставить("ТребуетсяПроверкаМЧДНаКлиенте", Истина);
	
	ДанныеДляПроверки = МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД();
	ДанныеФайлаИПодписи = МашиночитаемыеДоверенностиВызовСервера.ДанныеФайлаДоверенностиИПодписи(Объект.Ссылка);
	ДанныеДляПроверки.ДанныеДоверенности = ДанныеФайлаИПодписи.ДанныеФайла;
	ДанныеДляПроверки.ДанныеПодписи = ДанныеФайлаИПодписи.ДанныеПодписи;
	ПараметрыПроверкиМЧД.Вставить("ДанныеДляПроверки", ДанныеДляПроверки);
	
	МашиночитаемыеДоверенностиКлиент.ПроверитьДанныеМЧД(Оповещение, ПараметрыПроверкиМЧД, КонтекстДиагностики);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометкуУдаления(Команда)
	
	ТекстВопроса = МашиночитаемыеДоверенностиКлиент.ПолучитьТекстВопросаУстановитьСнятьПометкуУдаления(Объект);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСнятьПометкуУдаленияПродолжение", ЭтотОбъект, УникальныйИдентификатор);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТабличныйДокументМЧД()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	XMLфайлМЧД = МашиночитаемыеДоверенности.ПолныеДанныеДоверенностиНаСервереМЧД(Объект.Ссылка);
	РезультатФормирования = МашиночитаемыеДоверенности.ТабличныйДокументМЧД(XMLфайлМЧД, Истина);
	
	Если РезультатФормирования <> Неопределено Тогда
		ПолеПросмотра = РезультатФормирования.ПредставлениеДокумента;
	КонецЕсли;
			
КонецПроцедуры

// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
&НаСервереБезКонтекста
Функция НачатьОбновлениеСтатусаИзРеестраФНС(Знач Доверенность, Знач ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"МашиночитаемыеДоверенности.ОбновитьСтатусМЧДИзРеестраФНС", Доверенность);
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьФункцию
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ПриЗавершенииОбновленияСтатусаВРеестреФНС(ДлительнаяОперация, ДополнительныеПараметры) Экспорт

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Результат = ОбщегоНазначенияБЭДВызовСервера.ПолучитьИУдалитьИзВременногоХранилища(
		ДлительнаяОперация.АдресРезультата); // См. МашиночитаемыеДоверенности.ОбновитьСтатусМЧДИзРеестраФНС
	
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Результат.СтатусВРеестреФНС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Прочитать();
	
	МашиночитаемыеДоверенностиКлиент.ОповеститьОИзмененииМЧД(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	
	УправлениеФормой();
 
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиПослеСнятияПометкиОтзываМЧДЗавершение(РезультатПроверки, Параметры) Экспорт

	Если РезультатПроверки.Результат Тогда
		
		Модифицированность = Истина;
		
	Иначе
		
		ТекстСообщения = НСтр(
			"ru = 'Вернуть в работу не удалось. Криптографическая проверка подлинности данной доверенности не пройдена. 
			|Подпись неверна или доверенность была изменена после подписания. 
			|Обратитесь к контрагенту для получения новой доверенности'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	КонецЕсли;
	
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиМЧДЗавершение(РезультатПроверки, Параметры) Экспорт

	Если ЗначениеЗаполнено(РезультатПроверки) Тогда
		
		РезультатПроверкиПодписиМЧД = Неопределено;
		
		Если РезультатПроверки.Свойство("РезультатПроверкиПодписиМЧД") Тогда
			РезультатПроверкиПодписиМЧД = РезультатПроверки.РезультатПроверкиПодписиМЧД;	
		Иначе
					
			ТекстСообщения = НСтр(
				"ru = 'Криптографическая проверка подлинности данной доверенности не пройдена. 
				|Загрузите доверенность повторно и повторите проверку подписи.'");

			Если ЗначениеЗаполнено(РезультатПроверки.ТекстОшибки) Тогда
				ШаблонСообщения = НСтр(
					"ru = 'Криптографическая проверка подлинности данной доверенности не пройдена.
					|%1
					|Загрузите доверенность повторно и повторите проверку подписи.'");
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, РезультатПроверки.ТекстОшибки); 
			КонецЕсли;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

		КонецЕсли;
		
		МашиночитаемыеДоверенностиКлиент.ОбработатьРезультатПроверкиМЧД(РезультатПроверки);
		МашиночитаемыеДоверенностиВызовСервера.ОтразитьРезультатПроверкиМЧД(Объект.Ссылка, РезультатПроверки.Результат, 
			РезультатПроверки.ТекстОшибки, , РезультатПроверкиПодписиМЧД, Истина);
			
		Прочитать();
		
		МашиночитаемыеДоверенностиКлиент.ОповеститьОИзмененииМЧД(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
		
		УправлениеФормой();
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УбратьПометкуВернаЗавершение(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда

		Объект.Верна = Ложь;
		Объект.ТекстОшибкиПроверкиМЧД = "";
		Модифицированность = Истина;
		ПроверенаВручную = Ложь;
		
		УправлениеФормой();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.ФормаОбновить.Видимость = ЗначениеЗаполнено(Объект.СтатусВРеестреФНС);
	Элементы.ФормаПометитьОтозванной.Видимость = Не ЗначениеЗаполнено(Объект.СтатусВРеестреФНС) И ЕстьПравоИзмененияМЧД;
	Элементы.ФормаПерепроверитьПодпись.Видимость = ЕстьПравоИзмененияМЧД;
	
	Если Объект.Отозвана Тогда
		Элементы.ФормаПометитьОтозванной.Заголовок = НСтр("ru = 'Вернуть в работу'");
	Иначе
		Элементы.ФормаПометитьОтозванной.Заголовок = НСтр("ru = 'Пометить отозванной'");
	КонецЕсли;
	
	Элементы.ГруппаПроверенаВручную.Видимость = ПроверенаВручную;
	Если ПроверенаВручную Тогда
		Элементы.ДекорацияПроверенаВручную.Заголовок = Объект.ТекстОшибкиПроверкиМЧД;
	КонецЕсли;
	
	СведенияОРегистрации = Новый Структура;
	СведенияОРегистрации.Вставить("ДанныеПоМЧДВОчереди", Неопределено);
	СведенияОРегистрации.Вставить("ОписаниеОшибкиРегистрации", Неопределено);
	СведенияОРегистрации.Вставить("ДатаОбновленияСтатуса", Объект.ДатаОбновленияСтатуса);
	
	ИнтерфейсДокументовЭДОКлиент.ОформитьГруппуСостоянияИСтатусыМЧД(ЭтотОбъект, 
		Объект.Подписана, Объект.Верна, Объект.Отозвана, Объект.ДатаОтзыва, Объект.СтатусВРеестреФНС, СведенияОРегистрации);
	
	Элементы.ФормаПометитьВерной.Видимость = Не Объект.Верна Или ПроверенаВручную И ЕстьПравоИзмененияМЧД;
	
	Элементы.ДекорацияИнформированиеОНенадобностиНастраиватьПолномочия.Видимость = ЭтоАвтоматическоеДовериеПолнымПолномочиям;
	Элементы.ГруппаСкрипт.Видимость = Не ЭтоАвтоматическоеДовериеПолнымПолномочиям;
	Элементы.ВариантПроверки.Видимость = Не ЭтоАвтоматическоеДовериеПолнымПолномочиям;
	Элементы.ДеревоПолномочийСОграничениями.ТолькоПросмотр = ЭтоАвтоматическоеДовериеПолнымПолномочиям;
	
	Если Не ЭтоАвтоматическоеДовериеПолнымПолномочиям Тогда
		МашиночитаемыеДоверенностиКлиент.СформироватьЗаголовокВкладкиПолномочия(ЭтотОбъект);
		МашиночитаемыеДоверенностиКлиент.ОтобразитьВариантПроверки(ЭтотОбъект);
	КонецЕсли;
	
	УстановитьВидимостьКомандыПроверкаПодписи();
	УстановитьДоступностьИСостояниеПереключателяПравилаВключены();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРучнойПроверкиНаФорме()
	
	ПроверенаВручную = МашиночитаемыеДоверенности.ПроверенаВручную(Объект);
	
	Если ПроверенаВручную Тогда 
		ТекстЗаголовка = НСтр("ru = 'Снять ручную отметку ""Верна""'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Пометить верной вручную'");
	КонецЕсли;
	
	Элементы.ФормаПометитьВерной.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ЭтоАвтоматическоеДовериеПолнымПолномочиям = 
		МашиночитаемыеДоверенности.ЭтоМЧДСПолнымиПолномочиями(Объект.Ссылка)
		И Не МашиночитаемыеДоверенности.АвтоматическоеДовериеПолнымПолномочиямОтключено();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление() 

	МашиночитаемыеДоверенности.УстановитьУсловноеОформлениеФормыПросмотра(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборПоСостоянию()
	
	ВыбранныеСостояния = Новый Массив;
	
	Если Элементы.ПоказатьСкрытьПровереныУспешно.Пометка Тогда
		ВыбранныеСостояния.Добавить(Истина);
	КонецЕсли;

	Если Элементы.ПоказатьСкрытьОшибки.Пометка Тогда
		ВыбранныеСостояния.Добавить(Ложь);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПодписанныеДокументы, "ПодписьВерна",
		ВыбранныеСостояния, ВидСравненияКомпоновкиДанных.ВСписке, , ВыбранныеСостояния.Количество() <> 0,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПодписейПоПравиламДоверенности(ПроверяемыеДокументы = Неопределено)
	
	Оповещение = Новый ОписаниеОповещения("ПроверкаПравилЗавершение", ЭтотОбъект);
	
	ДополнительныеПараметры = МашиночитаемыеДоверенностиКлиент.НовыйПараметрыПроверкиПодписиМЧД();
	ДополнительныеПараметры.Вставить("Доверенность", Объект.Ссылка);
	ДополнительныеПараметры.Вставить("ОповещениеОЗавершении", Оповещение);
	Если ПроверяемыеДокументы <> Неопределено Тогда  
		ДополнительныеПараметры.Вставить("ПроверяемыеДокументы", ПроверяемыеДокументы);
	КонецЕсли;	
	
	МашиночитаемыеДоверенностиКлиент.ОбработатьВключениеПравилПроверкиДляМЧД(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПравилЗавершение(Результат, ДополнительныеПараметры) Экспорт 
		
	ПроверкаПравилЗавершениеВыполнитьНаСервере();
	
	УправлениеФормой();
	РазвернутьДеревоВизуализации();
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаПравилЗавершениеВыполнитьНаСервере()
	
	Прочитать();
	Элементы.ПодписанныеДокументы.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКомандыПроверкаПодписи()
	
	Элементы.ПроверитьПодписи.Видимость = ПравилаВключены; 
	Элементы.КонтекстноеМенюПроверитьПодписи.Видимость = ПравилаВключены;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьИСостояниеПереключателяПравилаВключены()
	
	Если Не ЭтоАвтоматическоеДовериеПолнымПолномочиям Тогда 
		
		ПравилаУстановлены = 
			МашиночитаемыеДоверенностиКлиентСервер.ПравилоНастроено(ЭтотОбъект);
		Элементы.ПравилаВключены.Доступность = ПравилаУстановлены;
		ПравилаВключены = ПравилаВключены И ПравилаУстановлены;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПодписанныеДокументыНаСервере()
	
	МашиночитаемыеДоверенности.ОбновитьЗаголовкиЭлементовФормы(Объект.Ссылка, Элементы);
	Элементы.ПодписанныеДокументы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСобытиеДереваПолномочийСОграничениями(ПараметрыВыполнения, ЭтоСобытиеУдалениеПравила)

	МашиночитаемыеДоверенности.ПодготовитьТаблицуНастроекДляВизуализацииВДереве(НастройкиПроверкиРасширенные,
		ПараметрыВыполнения, ЭтоСобытиеУдалениеПравила);
	ПостроитьДеревоВизуализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолномочийСОграничениямиПослеВыбора(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ОбработатьСобытиеДереваПолномочийСОграничениями(Результат, Ложь);
	РазвернутьДеревоВизуализации(Результат.ПорядковыйНомер);
	УстановитьДоступностьИСостояниеПереключателяПравилаВключены();
	МашиночитаемыеДоверенностиКлиент.СформироватьЗаголовокВкладкиПолномочия(ЭтотОбъект, ПравилаВключены);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПравилПроверки(Доверенность)

	Справочники.ПравилаПроверкиПолномочийМЧД.ЗаполнитьНастройкиПравилПроверки(Доверенность, ЭтотОбъект);
	ПостроитьДеревоВизуализации();
	
КонецПроцедуры	

&НаСервере
Процедура ПостроитьДеревоВизуализации()

	ТаблицаНастроек = РеквизитФормыВЗначение("НастройкиПроверкиРасширенные");
	МашиночитаемыеДоверенности.ПостроитьДеревоВизуализацииПравилПроверки(ДеревоПолномочийСОграничениями, ТаблицаНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоВизуализации(ПорядковыйНомер = 0)
	
	МашиночитаемыеДоверенностиКлиент.РазвернутьДеревоВизуализации(ЭтотОбъект, ПорядковыйНомер);
	
КонецПроцедуры

// Параметры:
//  Результат - см. МашиночитаемыеДоверенностиКлиент.УстановитьПометкуВернаЗавершение
//  Контекст - Неопределено
&НаКлиенте
Процедура ПометитьВернойЗавершение(Результат, Контекст = Неопределено) Экспорт
	
	Если Результат = Истина Тогда
		Прочитать();
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

// Параметры:
//  Результат - см. МашиночитаемыеДоверенностиКлиент.УстановитьПометкуОтозванаЗавершение
//  Контекст - Неопределено
&НаКлиенте
Процедура ПометитьОтозваннойЗавершение(Результат, Контекст = Неопределено) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Прочитать();
	
	Оповещение = Новый ОписаниеОповещения("ПроверкаПодписиПослеСнятияПометкиОтзываМЧДЗавершение", ЭтотОбъект);
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	ПараметрыПроверкиМЧД = Новый Структура();
	ПараметрыПроверкиМЧД.Вставить("МЧД", Объект.Ссылка);
	ПараметрыПроверкиМЧД.Вставить("ТребуетсяПроверкаМЧДНаКлиенте", Истина);
	
	ДанныеДляПроверки = МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД();
	ДанныеФайлаИПодписи = МашиночитаемыеДоверенностиВызовСервера.ДанныеФайлаДоверенностиИПодписи(Объект.Ссылка);
	ДанныеДляПроверки.ДанныеДоверенности = ДанныеФайлаИПодписи.ДанныеФайла;
	ДанныеДляПроверки.ДанныеПодписи = ДанныеФайлаИПодписи.ДанныеПодписи;
	ПараметрыПроверкиМЧД.Вставить("ДанныеДляПроверки", ДанныеДляПроверки);
	
	МашиночитаемыеДоверенностиКлиент.ПроверитьДанныеМЧД(Оповещение, ПараметрыПроверкиМЧД, КонтекстДиагностики);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометкуУдаленияПродолжение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСнятьПометкуУдаленияНаСервере(Объект.Ссылка, ДополнительныеПараметры);
	МашиночитаемыеДоверенностиКлиент.ОповеститьОбИзмененииПометкиУдаленияМЧД(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	Прочитать();
		
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура УстановитьСнятьПометкуУдаленияНаСервере(Знач Ссылка, Знач УникальныйИдентификатор)
	
	МашиночитаемыеДоверенности.УстановитьСнятьПометкуУдаления(Ссылка, УникальныйИдентификатор);
		
КонецПроцедуры

#КонецОбласти
